In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A' : [1, 2, np.nan], 'B' : [5, np.nan, np.nan], 'C' : [1, 2, 3]}

In [3]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna() #drop whole rows with any missing values, can drop columns by changing the axis = 1

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.dropna(thresh = 2) #thresh = 2 means we must have two non nan values in the row for the row to be dropped

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
df.fillna(value = 'FILL')

      A     B  C
0     1     5  1
1     2  FILL  2
2  FILL  FILL  3

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [12]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64